# 인덱스 지수화

In [1]:
from IPython.display import Image
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns


import warnings
warnings.filterwarnings(action='ignore')
sns.set()

#-------------------- 차트 관련 속성 (한글처리, 그리드) -----------
#plt.rc('font', family='NanumGothicOTF') # For MacOS
plt.rcParams['font.family']= 'Malgun Gothic'
plt.rcParams['axes.unicode_minus'] = False


#-------------------- 주피터 , 출력결과 넓이 늘리기 ---------------
from IPython.core.display import display, HTML
display(HTML("<style>.container{width:100% !important;}</style>"))
pd.set_option('display.max_rows', 100)
pd.set_option('display.max_columns', 100)
pd.set_option('max_colwidth', None)

# Data Load

## read_excel()
* https://pandas.pydata.org/docs/reference/api/pandas.read_excel.html
* pandas.read_excel(io, sheet_name=0, *, header=0, names=None, index_col=None, usecols=None, dtype=None, engine=None, converters=None, true_values=None, false_values=None, skiprows=None, nrows=None, na_values=None, keep_default_na=True, na_filter=True, verbose=False, parse_dates=False, date_parser=_NoDefault.no_default, date_format=None, thousands=None, decimal='.', comment=None, skipfooter=0, storage_options=None, dtype_backend=_NoDefault.no_default)

In [2]:
sample_df = pd.read_excel("../datasets/실습05_시가총액5_지수화.xlsx", sheet_name='일자별 시가총액', index_col=0)

sample_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 252 entries, 1 to 252
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A전자     252 non-null    int64
 1   B건설     252 non-null    int64
 2   C증권     252 non-null    float64
 3   D화학     252 non-null    int64
 4   E엔터     252 non-null    int64
 5   합계      252 non-null    int64
 6   지수      252 non-null    float64
dtypes: float64(2), int64(5)
memory usage: 15.8 KB

In [3]:
from pandas_datareader import data as pdr
import yfinance as yf
yf.pdr_override()
ks200 = pdr.get_data_yahoo('^KS200', '2008-01-02', '2009-01-08')
ks200.head()

[*********************100%***********************]  1 of 1 completed

                  Open        High         Low       Close   Adj Close  Volume
Date
2008-01-02  240.470001  240.649994  235.020004  235.300003  235.300003   76100
2008-01-03  232.940002  235.639999  230.860001  234.669998  234.669998   69000
2008-01-04  234.619995  236.589996  230.410004  235.770004  235.770004   91500
2008-01-07  229.389999  232.419998  229.089996  231.000000  231.000000   86700
2008-01-08  231.750000  232.320007  229.190002  230.339996  230.339996   88700

In [4]:
ks200.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 252 entries, 2008-01-02 to 2009-01-07
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Open       252 non-null    float64
 1   High       252 non-null    float64
 2   Low        252 non-null    float64
 3   Close      252 non-null    float64
 4   Adj Close  252 non-null    float64
 5   Volume     252 non-null    int64
dtypes: float64(5), int64(1)
memory usage: 13.8 KB

In [5]:
ks200=ks200[['Close']]
ks200.head()

                 Close
Date
2008-01-02  235.300003
2008-01-03  234.669998
2008-01-04  235.770004
2008-01-07  231.000000
2008-01-08  230.339996

In [6]:
# 시가총액 = 유동비율 * 상장주식수 * 주식 가격
ks200['지수200']=(ks200['Close']/ks200['Close'][0])*100
ks200.head()

                 Close       지수200
Date
2008-01-02  235.300003  100.000000
2008-01-03  234.669998   99.732255
2008-01-04  235.770004  100.199746
2008-01-07  231.000000   98.172544
2008-01-08  230.339996   97.892050

In [7]:
# dic={'지수200':ks200['지수200'],"지수5":sample_df['지수']}
# df=pd.DataFrame(dic)
# df.head()

In [12]:
sample_df.index=ks200.index
df=pd.concat([ks200['지수200'],sample_df['지수']],axis=1,ignore_index=True)
df.columns=['지수200','지수5']
df.head()

                 지수200         지수5
Date
2008-01-02  100.000000  100.000000
2008-01-03   99.732255  100.588806
2008-01-04  100.199746  102.177995
2008-01-07   98.172544  102.645330
2008-01-08   97.892050  101.290027